export const path = [
  // 사용자1 탑승
  { id: 1, name: "사용자1", lat: 37.65350753605161, lng: 127.05272873217041 },

  // 사용자2 탑승
  { id: 2, name: "사용자2", lat: 37.65325505753623, lng: 127.05318184012343 },

  // 사용자1 하차
  { id: 1, name: "사용자1", lat: 37.65311067453145, lng: 127.05368035131548 },

  // 사용자3 탑승
  { id: 3, name: "사용자3", lat: 37.65311036317523, lng: 127.05436027948892 },

  // 사용자2 하차
  { id: 2, name: "사용자2", lat: 37.65311019551619, lng: 127.0547229078438 },

  // 사용자4 탑승
  { id: 4, name: "사용자4", lat: 37.653362089238804, lng: 127.05553900952052 },

  // 사용자3 하차
  { id: 3, name: "사용자3", lat: 37.653361917955415, lng: 127.0559016390923 },

  // 사용자4 하차
  { id: 4, name: "사용자4", lat: 37.65343375919791, lng: 127.05640030926403 },

  // 사용자5 탑승
  { id: 5, name: "사용자5", lat: 37.65343356344683, lng: 127.05680826791813 },

  // 사용자6 탑승
  { id: 6, name: "사용자6", lat: 37.65357728054196, lng: 127.05771495426367 },

  // 사용자5 하차
  { id: 5, name: "사용자5", lat: 37.65418950135154, lng: 127.05862201241132 },

  // 사용자6 하차
  { id: 6, name: "사용자6", lat: 37.654297027637085, lng: 127.05980065822715 },
];

// polyline (센터에서 출발 → 사용자 픽업/하차 → 최종 목적지)
export const polylinePath = [
  {
    segmentId: 1,
    pointList: [
      { lat: 37.65350753605161, lng: 127.05272873217041 }, // 사용자1 탑승
      { lat: 37.65325505753623, lng: 127.05318184012343 }, // 사용자2 탑승
      { lat: 37.65311067453145, lng: 127.05368035131548 }, // 사용자1 하차
    ],
  },
  {
    segmentId: 2,
    pointList: [
      { lat: 37.65311036317523, lng: 127.05436027948892 }, // 사용자3 탑승
      { lat: 37.65311019551619, lng: 127.0547229078438 }, // 사용자2 하차
      { lat: 37.653362089238804, lng: 127.05553900952052 }, // 사용자4 탑승
    ],
  },
  {
    segmentId: 3,
    pointList: [
      { lat: 37.653361917955415, lng: 127.0559016390923 }, // 사용자3 하차
      { lat: 37.65343375919791, lng: 127.05640030926403 }, // 사용자4 하차
      { lat: 37.65343356344683, lng: 127.05680826791813 }, // 사용자5 탑승
    ],
  },
  {
    segmentId: 4,
    pointList: [
      { lat: 37.65357728054196, lng: 127.05771495426367 }, // 사용자6 탑승
      { lat: 37.65418950135154, lng: 127.05862201241132 }, // 사용자5 하차
      { lat: 37.654297027637085, lng: 127.05980065822715 }, // 사용자6 하차
    ],
  },
];

// marker
export const markerPath = [
  {
    nodeId: 1,
    bookId: 1,
    point: { lat: 37.65350753605161, lng: 127.05272873217041 },
    time: "10:00",
    type: "START", // 사용자1 탑승
  },
  {
    nodeId: 2,
    bookId: 2,
    point: { lat: 37.65325505753623, lng: 127.05318184012343 },
    time: "10:05",
    type: "START", // 사용자2 탑승
  },
  {
    nodeId: 3,
    bookId: 1,
    point: { lat: 37.65311067453145, lng: 127.05368035131548 },
    time: "10:15",
    type: "END", // 사용자1 하차
  },
  {
    nodeId: 4,
    bookId: 3,
    point: { lat: 37.65311036317523, lng: 127.05436027948892 },
    time: "10:20",
    type: "START", // 사용자3 탑승
  },
  {
    nodeId: 5,
    bookId: 2,
    point: { lat: 37.65311019551619, lng: 127.0547229078438 },
    time: "10:25",
    type: "END", // 사용자2 하차
  },
  {
    nodeId: 6,
    bookId: 4,
    point: { lat: 37.653362089238804, lng: 127.05553900952052 },
    time: "10:30",
    type: "START", // 사용자4 탑승
  },
  {
    nodeId: 7,
    bookId: 3,
    point: { lat: 37.653361917955415, lng: 127.0559016390923 },
    time: "10:35",
    type: "END", // 사용자3 하차
  },
  {
    nodeId: 8,
    bookId: 4,
    point: { lat: 37.65343375919791, lng: 127.05640030926403 },
    time: "10:40",
    type: "END", // 사용자4 하차
  },
  {
    nodeId: 9,
    bookId: 5,
    point: { lat: 37.65343356344683, lng: 127.05680826791813 },
    time: "10:45",
    type: "START", // 사용자5 탑승
  },
  {
    nodeId: 10,
    bookId: 6,
    point: { lat: 37.65357728054196, lng: 127.05771495426367 },
    time: "10:50",
    type: "START", // 사용자6 탑승
  },
  {
    nodeId: 11,
    bookId: 5,
    point: { lat: 37.65418950135154, lng: 127.05862201241132 },
    time: "10:55",
    type: "END", // 사용자5 하차
  },
  {
    nodeId: 12,
    bookId: 6,
    point: { lat: 37.654297027637085, lng: 127.05980065822715 },
    time: "11:00",
    type: "END", // 사용자6 하차
  },
];

// hightlight
export const highlightPath = [
  {
    bookId: 1,
    start: { lat: 37.65350753605161, lng: 127.05272873217041 },
    end: { lat: 37.65311067453145, lng: 127.05368035131548 },
    segmentList: [1],
  },
  {
    bookId: 2,
    start: { lat: 37.65325505753623, lng: 127.05318184012343 },
    end: { lat: 37.65311019551619, lng: 127.0547229078438 },
    segmentList: [1, 2],
  },
  {
    bookId: 3,
    start: { lat: 37.65311036317523, lng: 127.05436027948892 },
    end: { lat: 37.653361917955415, lng: 127.0559016390923 },
    segmentList: [2, 3],
  },
  {
    bookId: 4,
    start: { lat: 37.653362089238804, lng: 127.05553900952052 },
    end: { lat: 37.65343375919791, lng: 127.05640030926403 },
    segmentList: [3],
  },
  {
    bookId: 5,
    start: { lat: 37.65343356344683, lng: 127.05680826791813 },
    end: { lat: 37.65418950135154, lng: 127.05862201241132 },
    segmentList: [3, 4],
  },
  {
    bookId: 6,
    start: { lat: 37.65357728054196, lng: 127.05771495426367 },
    end: { lat: 37.654297027637085, lng: 127.05980065822715 },
    segmentList: [4],
  },
];
